-- Delete user type
INSERT INTO delete_user_type_tb
    (name)
VALUES
    ('앱 사용 불편'), -- 1
    ('사용하지 않는 앱'), -- 2
    ('부족한 컨텐츠'), -- 3
    ('타서비스 이용'), -- 4
    ('다른계정/재가입'), -- 5
    ('기타'); -- 6

-- Genre
INSERT INTO genre_tb
  (idx, name)
VALUES  
  (1, '팝업스토어'),
  (2, '전시회'),
  (3, '연극'),
  (4, '뮤지컬'),
  (5, '콘서트'),
  (6, '페스티벌');

-- Style
INSERT INTO style_tb
  (idx, name)
VALUES
  (1, '혼자'),
  (2, '함께'),
  (3, '반려동물'),
  (4, '가족'),
  (5, '포토존'),
  (6, '체험'),
  (7, '굿즈'),
  (8, '로맨스'),
  (9, '스포츠'),
  (10, '동양풍'),
  (11, '자연'),
  (12, '만화'),
  (13, '재미있는'),
  (14, '귀여운'),
  (15, '활기찬'),
  (16, '세련된'),
  (17, '힙한'),
  (18, '핫한'),
  (19, '편안한'),
  (20, '힐링'),
  (21, '감동'),
  (22, '예술적인'),
  (23, '신비로운'),
  (24, '공포'),
  (25, '미스터리'),
  (26, '추리'),
  (27, '진지한');

-- Age
INSERT INTO age_tb
  (idx, name)
VALUES
  (1, '전체'), -- 1
  (2, '아이들'), -- 2
  (3, '10대'), -- 3
  (4, '20대'), -- 4
  (5, '30대'), -- 5 
  (6, '40-50대'); -- 6

-- Inquiry Type
INSERT INTO inquiry_type_tb
  (name)
VALUES 
  ('이용 문의'), -- 1
  ('오류 신고'), -- 2
  ('서비스 제안'), -- 3
  ('기타'); -- 4

-- Report Type
INSERT INTO review_report_type_tb
    (name)
VALUES
    ('컨텐츠와 무관한 내용 게시'), -- 1
    ('개인정보 노출 위험'), -- 2
    ('욕설, 음란 등 부적절한 내용 게시'), -- 3
    ('이미지 도용, 사칭, 저작권 지식재산권 침해'), -- 4
    ('기타'); -- 5
